<h1>Pandas Cheat Sheet</h1>

<h3>Jupyter Notebook Shortcuts

<h5>hit (Cmd or Ctrl) + Shift + P to view list of all shortcuts</h5>

<h5>To enter command mode hit esc and you can move around with arrows</h5>
<h4><u>Notable Shortcuts</u></h4>
<h5>while in command mode:</h5>
<ol>
    <li>D + D to delete cell</li>
    <li>A to insert a cell above</li>
    <li>B to insert a cell below</li>
    <li>M to change current cell to Markdown</li>
    <li>Y to change current cell to code</li>
    <li>Shift + J or Shift + down to select cells below</li>
    <li>Shift + K or Shift + up to select cells above</li>
    <li>Shift + M to merge cells</li>
</ol>
<h5>command mode not necessary:</h5>
<ol>
    <li>Ctrl + Shift + - to split the cell where your cursor is</li>
    <li>Esc + F to do a find and replace</li>
    <li>Esc + O to toggle output 
</ol>

<h3>Import Pandas

In [178]:
import pandas as pd

<h3>Create Pandas Series from a list

In [179]:
#default index starts at 0
mySeries = pd.Series(["something", "VBA", "Python", "Pandas"])
print(mySeries)
print(f"mySeries at second index is {mySeries[2]}")

0    something
1          VBA
2       Python
3       Pandas
dtype: object
mySeries at second index is Python

In [142]:
#you can set your own index if you'd like
mySeries = pd.Series(["Excel", "VBA", "Python", "Pandas"], index=['a', 'b', 'c', 'd'])
print(mySeries)
print(f"mySeries at second index is {mySeries['c']}")

a     Excel
b       VBA
c    Python
d    Pandas
dtype: object
mySeries at second index is Python

<h3>Create Pandas Dataframes ( 2 ways )

In [143]:
#1.  -> Make a pandas Dataframe from a list of dictionaries
classSchedule = [{"CLASS": "Excel", "WEEK": 1},
                 {"CLASS": "VBA", "WEEK": 2},
                 {"CLASS": "Python", "WEEK": 3},
                 {"CLASS": "Pandas", "WEEK": 4},]
classSchedule_df = pd.DataFrame(classSchedule)
print(classSchedule_df)

    CLASS  WEEK
0   Excel     1
1     VBA     2
2  Python     3
3  Pandas     4

In [144]:
#2.  -> Make a pandas Dataframe from a dictionary of lists
classSchedule2 = {"CLASS": ["Excel","VBA","Python","Pandas"],
                  "WEEK": [1,2,3,4]}
classSchedule2_df = pd.DataFrame(classSchedule2)
print(classSchedule2_df)

    CLASS  WEEK
0   Excel     1
1     VBA     2
2  Python     3
3  Pandas     4

<h3> Import CSV into a Pandas Dataframe

In [145]:
myFile = "../../05-Ins_DataFunctions/Solved/Resources/dataSet.csv"

In [147]:
myFile_df = pd.read_csv(myFile)
print(myFile_df.head())

   id First Name Last Name Gender   Amount
0   1       Todd     Lopez      M   8067.7
1   2     Joshua     White      M   7330.1
2   3       Mary     Lewis      F  16335.0
3   4      Emily     Burns      F  12460.8
4   5  Christina    Romero      F  15271.9

<h3> Notable DataFrame Methods

<h4>The <u>head()</u> method</h4>

In [115]:
#show header and amount of rows (default=5) you want as parameter using the head() method
rows_to_show = 7
myFile_df.head(rows_to_show)

   id First Name Last Name Gender   Amount
0   1       Todd     Lopez      M   8067.7
1   2     Joshua     White      M   7330.1
2   3       Mary     Lewis      F  16335.0
3   4      Emily     Burns      F  12460.8
4   5  Christina    Romero      F  15271.9
5   6    Raymond   Andrews      M   7036.9
6   7     Sandra     Baker      F  14002.2

In [116]:
#look at rows of just one column
myFile_df['First Name'].head(3)

0      Todd
1    Joshua
2      Mary
Name: First Name, dtype: object

In [148]:
#look at rows of multiple columns NOTICE THE DOUBLE SQUARE BRACKETS
myFile_df[['First Name', 'Last Name']].head(3)

  First Name Last Name
0       Todd     Lopez
1     Joshua     White
2       Mary     Lewis

<h4>The <u>describe()</u> method</h4>

In [149]:
#View a statistical overview of the Dataframe...  NOTE IT IS SHOWING YOU OTHER METHODS YOU CAN USE
myFile_df.describe()

                id        Amount
count  1000.000000   1000.000000
mean    500.500000  10051.323600
std     288.819436   5831.230806
min       1.000000      3.400000
25%     250.750000   4854.875000
50%     500.500000  10318.050000
75%     750.250000  15117.425000
max    1000.000000  19987.400000

<h4>The <u>sum()</u> method</h4>

In [150]:
#Get the sum of a column
myFile_df['Amount'].sum()

10051323.600000001

<h4>The <u>unique()</u> method</h4>

In [151]:
#Gets a list of every element of the series
myFile_df["Gender"].unique()

array(['M', 'F'], dtype=object)

<h4>The <u>value_counts()</u> method</h4>

In [152]:
#Gets a list of every element and how many times it occurs
myFile_df["Gender"].value_counts()

M    515
F    485
Name: Gender, dtype: int64

In [153]:
myFile_df["Last Name"].value_counts().head(4)

Tucker      10
Kelly        9
Mcdonald     9
Wright       9
Name: Last Name, dtype: int64

<h4>The <u>iloc()</u> method</h4>

In [154]:
#Select a position by value
#iloc(rowstart:rowend,columnstart:columnend)
#if column is left blank it will just return row
myFile_df.iloc[7:10]

   id First Name Last Name Gender   Amount
7   8       Todd      Diaz      M  10911.0
8   9      Alice     Burke      F  14198.8
9  10      Wayne  Richards      M  16410.5

In [155]:
#all rows of multiple columns can easily be picked
myFile_df.iloc[:,1:4].head(3)

  First Name Last Name Gender
0       Todd     Lopez      M
1     Joshua     White      M
2       Mary     Lewis      F

<h4>The <u>loc()</u> method</h4>

In [156]:
#Select a position by column name.  This is picking rows 7-10 in the Amount Column.
myFile_df.loc[7:10]["Amount"]

7     10911.0
8     14198.8
9     16410.5
10    15029.4
Name: Amount, dtype: float64

In [157]:
#select column
myFile_df.loc[:]["Amount"]

0       8067.7
1       7330.1
2      16335.0
3      12460.8
4      15271.9
        ...
995    17868.5
996    15182.9
997     3720.7
998    10824.6
999     6090.7
Name: Amount, Length: 1000, dtype: float64

In [158]:
#select row
myFile_df.loc[5]

id                  6
First Name    Raymond
Last Name     Andrews
Gender              M
Amount         7036.9
Name: 5, dtype: object

In [159]:
#Select rows based on a condition in a column
myFile_df.loc[myFile_df["Amount"] > 19800]

      id First Name  Last Name Gender   Amount
13    14       John     Turner      M  19909.3
264  265  Stephanie  Rodriguez      F  19907.4
440  441  Katherine    Wheeler      F  19987.4
550  551      Larry   Martinez      M  19877.7
632  633        Ann      Clark      F  19899.6
791  792      Keith       Reed      M  19945.3
993  994      Aaron   Mitchell      M  19881.7

<h4>The <u>rename()</u> method</h4>

In [160]:
#rename one or more columns
myFile_df.head()

   id First Name Last Name Gender   Amount
0   1       Todd     Lopez      M   8067.7
1   2     Joshua     White      M   7330.1
2   3       Mary     Lewis      F  16335.0
3   4      Emily     Burns      F  12460.8
4   5  Christina    Romero      F  15271.9

In [161]:
myFile_df.rename(columns={"id":"Employee ID"}).head()

   Employee ID First Name Last Name Gender   Amount
0            1       Todd     Lopez      M   8067.7
1            2     Joshua     White      M   7330.1
2            3       Mary     Lewis      F  16335.0
3            4      Emily     Burns      F  12460.8
4            5  Christina    Romero      F  15271.9

In [162]:
#rearrange columns
myFile_df[["Last Name", "First Name"]].head()

  Last Name First Name
0     Lopez       Todd
1     White     Joshua
2     Lewis       Mary
3     Burns      Emily
4    Romero  Christina

In [173]:
myFile_df.columns

Index(['id', 'First Name', 'Last Name', 'Gender', 'Amount'], dtype='object')

In [176]:
myFile_df.index.rename(index={"id": "Employee ID"})

TypeError: rename() got an unexpected keyword argument 'index'

In [175]:
myFile_df.columns

Index(['id', 'First Name', 'Last Name', 'Gender', 'Amount'], dtype='object')

<h3>Apply Calculation to Column and Append Calculated Data to a New Column

In [97]:
#Save into a variable (thousandsAmount) a series from dataframe (myFile_df) with every 
#value in the 'Amount' column divided by 1000
thousandsAmount = myFile_df["Amount"]/1000

#Create a new column in dataframe and fill with calculated data
myFile_df["Thousands of Dollars"] = thousandsAmount

myFile_df.head()

   id First Name Last Name Gender   Amount  Thousands of Dollars
0   1       Todd     Lopez      M   8067.7                8.0677
1   2     Joshua     White      M   7330.1                7.3301
2   3       Mary     Lewis      F  16335.0               16.3350
3   4      Emily     Burns      F  12460.8               12.4608
4   5  Christina    Romero      F  15271.9               15.2719